# SetSketchPlaneAndCurve Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveElement..::..SetSketchPlaneAndCurve Method
CurveElement Class See Also
---
Sets the sketch plane and the curve for this CurveElement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void SetSketchPlaneAndCurve(
	SketchPlane sketchPlane,
	Curve curve
)
```

Visual Basic
---
```text
Public Sub SetSketchPlaneAndCurve ( _
	sketchPlane As SketchPlane, _
	curve As Curve _
)
```

Visual C++
---
```text
public:
void SetSketchPlaneAndCurve(
	SketchPlane^ sketchPlane,
	Curve^ curve
)
```

# ### Parameters
sketchPlane
    Type: Autodesk.Revit.DB..::..SketchPlaneThe new sketch plane.
curve
    Type: Autodesk.Revit.DB..::..CurveThe new curve.
# Remarks
Unlike the setters of SketchPlane and GeometryCurve, this method will reset relationships between the two properties and with other elements. To set a geometry curve which belongs to a sketch-based elements, use GeometryCurve
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown if the argument is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if the CurveElement is CurveByPoints or belongs to a Path3d element. -- or -- Thrown if the sketch plane is set on a DetailCurve. -- or -- Thrown if the sketch plane is not suitable. -- or -- Thrown if the CurveElement belongs to a sketch-based element. -- or -- Thrown if modifying the sketch plane is not allowed. -- or -- Thrown if the CurveElement cannot be moved out of its sketch plane. -- or -- Thrown if the input curve is of a type different from the current. -- or -- Thrown if the input curve is bound and the current is not or vice versa. -- or -- Thrown if the input curve is helical. -- or -- Thrown if the input curve lies outside of the SketchPlane of the current curve. |

# See Also
CurveElement Class
Autodesk.Revit.DB Namespace